In [13]:
import pandas as pdu

In [14]:
p=pd.read_excel('./Datasets/B.xlsx')
p

    Name          Disease
0  Ahmad         Diabatic
1   Nida  Iron Deficiency

In [15]:
p=p.set_index(['Name'])
p

               Disease
Name
Ahmad         Diabatic
Nida   Iron Deficiency

In [16]:
s=pd.read_excel('./Datasets/C.xlsx')
s=s.set_index(['Name'])
s

     Designation
Name
Ali       Doctor
Nida       Nurse

## merge( )

In [38]:
pd.merge(s, p, how='outer', left_index=True, right_index=True)

      Designation          Disease
Name
Ahmad         NaN         Diabatic
Ali        Doctor              NaN
Nida        Nurse  Iron Deficiency

In [39]:
pd.merge(s, p, how='left', left_index=True, right_index=True)

     Designation          Disease
Name
Ali       Doctor              NaN
Nida       Nurse  Iron Deficiency

In [40]:
pd.merge(s, p, how='inner', left_index=True, right_index=True)

     Designation          Disease
Name
Nida       Nurse  Iron Deficiency

In [41]:
pd.merge(s, p, how='right', left_index=True, right_index=True)

      Designation          Disease
Name
Ahmad         NaN         Diabatic
Nida        Nurse  Iron Deficiency

## reset_index()

In [17]:
s=s.reset_index()
s

   Name Designation
0   Ali      Doctor
1  Nida       Nurse

In [18]:
p=p.reset_index()
p

    Name          Disease
0  Ahmad         Diabatic
1   Nida  Iron Deficiency

In [27]:
pd.merge(s, p, how='left')

   Name Designation Location          Disease
0   Ali      Doctor  Phase-6              NaN
1  Nida       Nurse  Phase-2  Iron Deficiency

In [20]:
pd.merge(s, p, how='left', left_on='Name', right_on='Name')

   Name Designation          Disease
0   Ali      Doctor              NaN
1  Nida       Nurse  Iron Deficiency

In [21]:
s['Location']=pd.Series({0:'Phase-6',1:'Phase-2'})

In [22]:
s

   Name Designation Location
0   Ali      Doctor  Phase-6
1  Nida       Nurse  Phase-2

In [25]:
p['Location']=pd.Series({0:'Phase-1',1:'Phase-2'})

In [26]:
p

    Name          Disease Location
0  Ahmad         Diabatic  Phase-1
1   Nida  Iron Deficiency  Phase-2